In [1]:
import pandas as pd

In [82]:
df_1 = pd.read_excel('../OES/oesm13ma/MSA_M2013_dl_1_AK_IN.xls')
df_2 = pd.read_excel('../OES/oesm13ma/MSA_M2013_dl_2_KS_NY.xls')
df_3 = pd.read_excel('../OES/oesm13ma/MSA_M2013_dl_3_OH_WY.xls')

In [135]:
# df_concat = pd.concat([df_1, df_2, df_3], ignore_index=True)
df_concat = pd.read_excel('../OES/oesm19ma/MSA_M2019_dl.xlsx')

In [136]:
df_concat.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 142410 entries, 0 to 142409
Data columns (total 27 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   area          142410 non-null  int64
 1   area_title    142410 non-null  object
 2   PRIM_STATE    142410 non-null  object
 3   own_code      142410 non-null  int64
 4   occ_code      142410 non-null  object
 5   occ_title     142410 non-null  object
 6   o_group       142410 non-null  object
 7   tot_emp       142410 non-null  object
 8   emp_prse      142410 non-null  object
 9   jobs_1000     142410 non-null  object
 10  loc_quotient  142410 non-null  object
 11  pct_total     0 non-null       float64
 12  h_mean        142410 non-null  object
 13  a_mean        142410 non-null  object
 14  mean_prse     142410 non-null  object
 15  h_pct10       142410 non-null  object
 16  h_pct25       142410 non-null  object
 17  h_median      142410 non-null  object
 18  h_pct75       142410 non-null  object
 19  h_pct90       142410 non-null  object
 20  a_pct10       142410 non-null  object
 21  a_pct25       142410 non-null  object
 22  a_median      142410 non-null  object
 23  a_pct75       142410 non-null  object
 24  a_pct90       142410 non-null  object
 25  annual        7341 non-null    object
 26  hourly        238 non-null     object
dtypes: float64(1), int64(2), object(24)
memory usage: 29.3+ MB

In [137]:
df_total = df_concat[df_concat.PRIM_STATE != 'PR']
len(df_total.PRIM_STATE.unique())

187

In [139]:
df_total

,area,area_title,PRIM_STATE,own_code,occ_code,occ_title,o_group,tot_emp,emp_prse,jobs_1000,...,h_median,h_pct75,h_pct90,a_pct10,a_pct25,a_median,a_pct75,a_pct90,annual,hourly
0,10180,"Abilene, TX",TX,1235,00-0000,All Occupations,total,66510,3.1,1000,...,15.64,24.05,35.21,18580,22810,32530,50030,73230,NaN,NaN
1,10180,"Abilene, TX",TX,1235,11-0000,Management Occupations,major,2670,5.8,40.137,...,37.51,51.88,75.57,37140,56610,78030,107910,157190,NaN,NaN
2,10180,"Abilene, TX",TX,1235,11-1021,General and Operations Managers,detailed,1100,7.7,16.499,...,35.51,51.38,74.29,22810,50350,73850,106870,154520,NaN,NaN
3,10180,"Abilene, TX",TX,1235,11-2022,Sales Managers,detailed,110,18.8,1.728,...,57.65,74.55,99.8,47360,72140,119920,155050,207570,NaN,NaN
4,10180,"Abilene, TX",TX,1235,11-2030,Public Relations and Fundraising Managers,detailed,40,29.7,0.571,...,*,*,*,*,*,*,*,*,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
142405,79600,"Worcester, MA-CT",MA-CT,1235,53-7062,"Laborers and Freight, Stock, and Material Move...",detailed,5490,6.7,19.107,...,14.59,18.45,22.71,25340,26280,30350,38380,47240,NaN,NaN
142406,79600,"Worcester, MA-CT",MA-CT,1235,53-7063,Machine Feeders and Offbearers,detailed,150,21.6,0.515,...,15.39,19.24,22.95,26390,28450,32020,40010,47740,NaN,NaN
142407,79600,"Worcester, MA-CT",MA-CT,1235,53-7064,"Packers and Packagers, Hand",detailed,1340,20.6,4.656,...,13.44,15.06,19.09,25280,25900,27960,31330,39700,NaN,NaN
142408,79600,"Worcester, MA-CT",MA-CT,1235,53-7065,Stockers and Order Fillers,detailed,4230,5.4,14.725,...,14.27,17.71,22.76,25310,26190,29690,36840,47350,NaN,NaN
142409,79600,"Worcester, MA-CT",MA-CT,1235,53-7081,Refuse and Recyclable Material Collectors,detailed,160,36.6,0.54,...,22.1,25.58,28.74,27800,35720,45970,53200,59780,NaN,NaN

In [140]:
df_total.to_csv('../OES/oesm19ma/total.csv', index=False)

In [141]:
df_oes_list = pd.read_csv('../OES/oes_codes.csv')
df_oes_list

      AREA   CBSA                              MSA_Name  state_code
0    10180  10180                           Abilene, TX          48
1    10420  10420                             Akron, OH          39
2    10500  10500                            Albany, GA          13
3    41420  10540                    Albany-Lebanon, OR          41
4    10580  10580           Albany-Schenectady-Troy, NY          36
..     ...    ...                                   ...         ...
379  76750  38860           Portland-South Portland, ME          23
380  77200  39300             Providence-Warwick, RI-MA          44
381  78100  44140                       Springfield, MA          25
382  79600  49340                      Worcester, MA-CT          25
383  39100  39100  Poughkeepsie-Newburgh-Middletown, NY          36

[384 rows x 4 columns]

In [143]:
# df_all = df_total[df_total['OCC_CODE'] == '00-0000']
df_all = df_total[df_total['occ_code'] == '00-0000']
df_all

,area,area_title,PRIM_STATE,own_code,occ_code,occ_title,o_group,tot_emp,emp_prse,jobs_1000,...,h_median,h_pct75,h_pct90,a_pct10,a_pct25,a_median,a_pct75,a_pct90,annual,hourly
0,10180,"Abilene, TX",TX,1235,00-0000,All Occupations,total,66510,3.1,1000,...,15.64,24.05,35.21,18580,22810,32530,50030,73230,NaN,NaN
467,10420,"Akron, OH",OH,1235,00-0000,All Occupations,total,329610,1.2,1000,...,18.57,29.38,42.4,19840,25680,38640,61100,88180,NaN,NaN
979,10500,"Albany, GA",GA,1235,00-0000,All Occupations,total,59000,2.2,1000,...,15.06,24.91,36.58,17640,20960,31320,51820,76090,NaN,NaN
1217,10540,"Albany, OR",OR,1235,00-0000,All Occupations,total,45140,2.1,1000,...,18.55,27.67,39.01,24250,28300,38580,57560,81130,NaN,NaN
1472,10580,"Albany-Schenectady-Troy, NY",NY,1235,00-0000,All Occupations,total,452910,1.3,1000,...,21.43,32.99,48.3,24580,29900,44580,68620,100460,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
140165,76900,"Portsmouth, NH-ME",NH-ME,1235,00-0000,All Occupations,total,96120,1.5,1000,...,22.45,35.2,51.73,23500,31260,46690,73220,107610,NaN,NaN
140505,77200,"Providence-Warwick, RI-MA",RI-MA,1235,00-0000,All Occupations,total,579060,0.7,1000,...,20.53,33.2,49.06,24480,28940,42700,69050,102050,NaN,NaN
141113,78100,"Springfield, MA-CT",MA-CT,1235,00-0000,All Occupations,total,334500,1.6,1000,...,20.3,31.19,45.62,25510,29910,42230,64870,94890,NaN,NaN
141642,78700,"Waterbury, CT",CT,1235,00-0000,All Occupations,total,67790,2.8,1000,...,20.11,31.17,45.53,23650,28350,41830,64830,94700,NaN,NaN
141921,79600,"Worcester, MA-CT",MA-CT,1235,00-0000,All Occupations,total,287340,1.2,1000,...,21.15,32.76,48.03,25630,30450,44000,68140,99900,NaN,NaN

In [146]:
# df_all_merged = df_oes_list.merge(df_all, how='left',  on='AREA')
df_all_merged = df_oes_list.merge(df_all, how='left',  left_on='AREA', right_on='area')
df_all_merged

,AREA,CBSA,MSA_Name,state_code,area,area_title,PRIM_STATE,own_code,occ_code,occ_title,...,h_median,h_pct75,h_pct90,a_pct10,a_pct25,a_median,a_pct75,a_pct90,annual,hourly
0,10180,10180,"Abilene, TX",48,10180.0,"Abilene, TX",TX,1235.0,00-0000,All Occupations,...,15.64,24.05,35.21,18580,22810,32530,50030,73230,NaN,NaN
1,10420,10420,"Akron, OH",39,10420.0,"Akron, OH",OH,1235.0,00-0000,All Occupations,...,18.57,29.38,42.4,19840,25680,38640,61100,88180,NaN,NaN
2,10500,10500,"Albany, GA",13,10500.0,"Albany, GA",GA,1235.0,00-0000,All Occupations,...,15.06,24.91,36.58,17640,20960,31320,51820,76090,NaN,NaN
3,41420,10540,"Albany-Lebanon, OR",41,41420.0,"Salem, OR",OR,1235.0,00-0000,All Occupations,...,18.92,29.53,43.69,24160,27960,39360,61430,90870,NaN,NaN
4,10580,10580,"Albany-Schenectady-Troy, NY",36,10580.0,"Albany-Schenectady-Troy, NY",NY,1235.0,00-0000,All Occupations,...,21.43,32.99,48.3,24580,29900,44580,68620,100460,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
379,76750,38860,"Portland-South Portland, ME",23,76750.0,"Portland-South Portland, ME",Portland,1235.0,00-0000,All Occupations,...,19.79,29.91,44.94,24230,29400,41160,62220,93470,NaN,NaN
380,77200,39300,"Providence-Warwick, RI-MA",44,77200.0,"Providence-Warwick, RI-MA",RI-MA,1235.0,00-0000,All Occupations,...,20.53,33.2,49.06,24480,28940,42700,69050,102050,NaN,NaN
381,78100,44140,"Springfield, MA",25,78100.0,"Springfield, MA-CT",MA-CT,1235.0,00-0000,All Occupations,...,20.3,31.19,45.62,25510,29910,42230,64870,94890,NaN,NaN
382,79600,49340,"Worcester, MA-CT",25,79600.0,"Worcester, MA-CT",MA-CT,1235.0,00-0000,All Occupations,...,21.15,32.76,48.03,25630,30450,44000,68140,99900,NaN,NaN
383,39100,39100,"Poughkeepsie-Newburgh-Middletown, NY",36,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [147]:
df_all_merged.to_csv('../OES/2019_all.csv', index=False)

In [148]:
import pymongo
from pymongo import MongoClient

In [152]:
file_list = ['2010_all.csv','2011_all.csv','2012_all.csv','2013_all.csv','2014_all.csv','2015_all.csv','2016_all.csv','2017_all.csv','2018_all.csv','2019_all.csv']

In [156]:
df_oes = pd.DataFrame()
for file in file_list:
    df_temp = pd.read_csv('../OES/' + file)
    df_oes = pd.concat([df_oes, df_temp], ignore_index=True)

In [157]:
df_oes

,YEAR,AREA,CBSA,MSA_Name,state_code,PRIM_STATE,AREA_NAME,OCC_CODE,OCC_TITLE,GROUP,...,H_PCT75,H_PCT90,A_PCT10,A_PCT25,A_MEDIAN,A_PCT75,A_PCT90,ANNUAL,HOURLY,OCC_GROUP
0,2010,10180,10180,"Abilene, TX",48,TX,"Abilene, TX",00-0000,All Occupations,total,...,20.05,29.41,16170,18510,26800,41710,61170,NaN,NaN,NaN
1,2010,10420,10420,"Akron, OH",39,OH,"Akron, OH",00-0000,All Occupations,total,...,24.10,35.29,16930,20680,31760,50120,73410,NaN,NaN,NaN
2,2010,10500,10500,"Albany, GA",13,GA,"Albany, GA",00-0000,All Occupations,total,...,21.56,30.80,16060,18620,26970,44850,64060,NaN,NaN,NaN
3,2010,41420,10540,"Albany-Lebanon, OR",41,OR,"Salem, OR",00-0000,All Occupations,total,...,23.64,34.19,18920,22610,33200,49180,71120,NaN,NaN,NaN
4,2010,10580,10580,"Albany-Schenectady-Troy, NY",36,NY,"Albany-Schenectady-Troy, NY",00-0000,All Occupations,total,...,27.70,39.86,18630,24750,37780,57620,82900,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3835,2019,76750,38860,"Portland-South Portland, ME",23,76750,"Portland-South Portland, ME",00-0000,All Occupations,total,...,29.91,44.94,24230,29400,41160,62220,93470,NaN,NaN,NaN
3836,2019,77200,39300,"Providence-Warwick, RI-MA",44,77200,"Providence-Warwick, RI-MA",00-0000,All Occupations,total,...,33.20,49.06,24480,28940,42700,69050,102050,NaN,NaN,NaN
3837,2019,78100,44140,"Springfield, MA",25,78100,"Springfield, MA-CT",00-0000,All Occupations,total,...,31.19,45.62,25510,29910,42230,64870,94890,NaN,NaN,NaN
3838,2019,79600,49340,"Worcester, MA-CT",25,79600,"Worcester, MA-CT",00-0000,All Occupations,total,...,32.76,48.03,25630,30450,44000,68140,99900,NaN,NaN,NaN
3839,2019,39100,39100,"Poughkeepsie-Newburgh-Middletown, NY",36,NaN,NaN,00-0000,All Occupations,total,...,28.98,41.93,24340,28130,39380,60270,87210,NaN,NaN,NaN

In [158]:
df_oes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3840 entries, 0 to 3839
Data columns (total 30 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   YEAR          3840 non-null   int64
 1   AREA          3840 non-null   int64
 2   CBSA          3840 non-null   int64
 3   MSA_Name      3840 non-null   object
 4   state_code    3840 non-null   int64
 5   PRIM_STATE    3786 non-null   object
 6   AREA_NAME     3765 non-null   object
 7   OCC_CODE      3840 non-null   object
 8   OCC_TITLE     3840 non-null   object
 9   GROUP         1152 non-null   object
 10  TOT_EMP       3840 non-null   int64
 11  EMP_PRSE      3840 non-null   float64
 12  JOBS_1000     3840 non-null   int64
 13  LOC QUOTIENT  3840 non-null   int64
 14  H_MEAN        3840 non-null   float64
 15  A_MEAN        3840 non-null   int64
 16  MEAN_PRSE     3840 non-null   float64
 17  H_PCT10       3840 non-null   float64
 18  H_PCT25       3840 non-null   float64
 19  H_MEDIAN      3840 non-null   float64
 20  H_PCT75       3840 non-null   float64
 21  H_PCT90       3840 non-null   float64
 22  A_PCT10       3840 non-null   int64
 23  A_PCT25       3840 non-null   int64
 24  A_MEDIAN      3840 non-null   int64
 25  A_PCT75       3840 non-null   int64
 26  A_PCT90       3840 non-null   int64
 27  ANNUAL        0 non-null      float64
 28  HOURLY        0 non-null      float64
 29  OCC_GROUP     2688 non-null   object
dtypes: float64(10), int64(13), object(7)
memory usage: 900.1+ KB

In [159]:
# Create instance of MongoClient
client = MongoClient()
# Connection URI
client = MongoClient('<conn string>')
# Select database
db = client['MSA']
# create new collection
collection = db.OES_raw
# turn dataframe into readable format for mongo
df_dict = df_oes.to_dict(orient='records')
# write dataframe to unemployment_predicted_2024 collection
collection.insert_many(df_dict)